{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_1", "kernel_dim2": 5, "kernel_dim1": 5, "activation": "linear", "trainable": true, "dim_ordering": "tf", "kernel_dim3": 5, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 50, 50, 50, 1], "W_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_1"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_2", "kernel_dim2": 3, "kernel_dim1": 3, "activation": "linear", "trainable": true, "dim_ordering": "tf", "kernel_dim3": 3, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_2"}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3, 3], "strides": [3, 3, 3], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_3", "kernel_dim2": 3, "kernel_dim1": 3, "activation": "linear", "trainable": true, "dim_ordering": "tf", "kernel_dim3": 3, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_3"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_4", "kernel_dim2": 3, "kernel_dim1": 3, "activation": "linear", "trainable": true, "dim_ordering": "tf", "kernel_dim3": 3, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_4"}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3, 3], "strides": [3, 3, 3], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 13824.0, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 256}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.1, "trainable": true, "name": "leakyrelu_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-06, "l1": 0.0}}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 2}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}